Tekla Open API Reference for Tekla Structures 2025
Chamfer Constructor
Overload List
Name | Description
Chamfer()
 Creates a chamfer instance with the basic shape type CHAMFER_NONE.
Chamfer(Double, Double, Chamfer.ChamferTypeEnum)
 Instantiates a chamfer with the given values.
Top
See Also
Reference
Chamfer Class
Tekla.Structures.Model Namespace